src/AccumulationRegisters/ВнутренниеЗаказы/ВнутренниеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВнутренниеЗаказы</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <type>
      <types>EnumRef.СтатусыПартийТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/СтатусыПартийТоваров/СтатусыПартийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПартийТоваров</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ВПереработку</name>
  </enumValues>
  <enumValues>
    <name>Купленный</name>
  </enumValues>
  <enumValues>
    <name>НаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ПоОрдеру</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>ВозвратнаяТараОтложеннаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>КупленныйОтложеннаяОтгрузка</name>
    <comment>Купленный отложенная отгрузка</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <comment>(Общ)</comment>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ВнутренниеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезервеНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеЗаказовПокупателей</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыВнутреннегоЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНапоминания</name>
    <comment>(Упр)</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <comment>(Упр)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НапомнитьОСобытии</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратнаяТара</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВнутренниеЗаказы/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект - объект проводимого документа, 
//  Параметры      - структура, содержащая значения параметров необходимых для контроля остатков
//		Обязательные параметры:
//			ИмяТабЧасти       - имя таб.части документа
//			ИмяРеквизитаЗаказ - имя реквизита, в котором содержится внутренний заказ
//			ЗаказВШапке       - реквизит, который содержит внутренний заказ, находится в шапке
//		Необязательные параметры:
//			КачествоТолькоНовый           - Если Истина, то контроль остатков производится только для строк с качеством "Новый"
//			ТолькоОтрицательноеКоличество - Если Истина, то контроль остатков производится только для строк с отрицательным количеством.
//  Отказ          - флаг отказа в проведении,
//  Заголовок      - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, Параметры, Отказ, Заголовок, РежимПроведения) Экспорт

	Если РежимПроведения <> РежимПроведенияДокумента.Оперативный Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТабличнойЧасти   = Параметры["ИмяТабЧасти"];
	//проверка наличия строк в табличной части
	Если  ДокументОбъект[ИмяТабличнойЧасти].Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	МетаданныеТабЧастиДокумента = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	
	ЕстьХарактеристика  = МетаданныеТабЧастиДокумента.Реквизиты.Найти("ХарактеристикаНоменклатуры") <> Неопределено;
	текСтатусПартии = ?( ИмяТабличнойЧасти = "ВозвратнаяТара",
		Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,
		Перечисления.СтатусыПартийТоваров.Купленный);

	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    СтруктураПараметров = новый Структура("МетаданныеДокумента,ИмяДокумента,ИмяТабличнойЧасти,МетаданныеТабЧастиДокумента,Ссылка, ЕстьХарактеристика,Параметры",
		МетаданныеДокумента,ИмяДокумента,ИмяТабличнойЧасти,МетаданныеТабЧастиДокумента,ДокументОбъект.Ссылка,ЕстьХарактеристика,Параметры);
		
	СформироватьВременнуюТаблицуДокумента(МенеджерВременныхТаблиц,СтруктураПараметров);
	Если глЗначениеПеременной("ИспользоватьБлокировкуДанных")  Тогда
		
		СтруктураПараметровБлокировки = Новый Структура(
			"ТипТаблицы,ИмяТаблицы,ИсточникДанных,ИмяВременнойТаблицы"
			,"РегистрНакопления"
			,"ВнутренниеЗаказы"
			,МенеджерВременныхТаблиц
			,"ВременнаяТаблицаДокумента");
			
		СтруктураИсточникаДанных = Новый Структура(
			"Заказчик,ВнутреннийЗаказ,Номенклатура"
			,"Заказчик"
			,"Заказ"
			,"Номенклатура");
		Если ЕстьХарактеристика  Тогда
			СтруктураИсточникаДанных.Вставить("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
		КонецЕсли;
	
		СтруктураЗначенийБлокировки = новый Структура("СтатусПартии",текСтатусПартии);
		
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки,СтруктураЗначенийБлокировки,СтруктураИсточникаДанных, Отказ, Заголовок);

	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("СтатусПартии", текСтатусПартии);

	ТекстЗапроса = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура                             КАК Номенклатура,
	|	Док.Номенклатура.Представление               КАК НоменклатураПредставление,
	|	Док.ЕдИзм				                     КАК ЕдиницаИзмерения,
	|	Док.Заказ									 КАК Заказ,
	|	Док.Заказчик								 КАК Заказчик,
	|	Док.ЕдИзм.Представление        				 КАК ЕдиницаПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры				 КАК ХарактеристикаНоменклатуры,"
	,"") + "
	|	СУММА(Док.ДокументКоличество)             	 КАК ДокументКоличество, 
	|	ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0) КАК ОстатокКоличество
	|ИЗ ВременнаяТаблицаДокумента КАК Док
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВнутренниеЗаказы.Остатки(,
	|		(Номенклатура, ВнутреннийЗаказ"+?(ЕстьХарактеристика,",ХарактеристикаНоменклатуры","")+") В (ВЫБРАТЬ Номенклатура,Заказ"+?(ЕстьХарактеристика,",ХарактеристикаНоменклатуры","")+" ИЗ ВременнаяТаблицаДокумента)
	|   И СтатусПартии    = &СтатусПартии) КАК Остатки
	|ПО 
	|	Док.Номенклатура  = Остатки.Номенклатура
	|	И Док.Заказ = Остатки.ВнутреннийЗаказ "
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"")+"
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура,
	|   Док.ЕдИзм,
	|	Док.Заказ,
	|	Док.Заказчик"
	+ ?(ЕстьХарактеристика, "
	|	, Док.ХарактеристикаНоменклатуры "
	,"") + "
	|	
	|ИМЕЮЩИЕ ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0) < СУММА(Док.ДокументКоличество)
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ВнутренниеЗаказы.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы	
	|";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл			

		СтрокаСообщения = "Остатка " + 
		УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление,
								  ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатуры, "")) +
		", заказанного по документу " + (Выборка.Заказ) + " недостаточно.";

		УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, Выборка.ОстатокКоличество, Выборка.ДокументКоличество,
		Выборка.ЕдиницаПредставление, Отказ, Заголовок);		
		
	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()

Процедура СформироватьВременнуюТаблицуДокумента(МенеджерВременныхТаблиц, СтруктураПараметров)
	Перем Параметры;
	
	//параметры для построения запроса
	Параметры 			= СтруктураПараметров.Параметры; //параметры, переданные в процедуру контроля остатков из модуля документа
    МетаданныеТабЧастиДокумента = СтруктураПараметров.МетаданныеТабЧастиДокумента;
	ЕстьЕдИзм           = МетаданныеТабЧастиДокумента.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено;
	ИмяРеквизитаЗаказ   = Параметры["ИмяРеквизитаЗаказ"];
	ПутьКЗаказу         = ?(Параметры["ЗаказВШапке"], "Ссылка.", "") + ИмяРеквизитаЗаказ;
	ИмяТаблицы          = СтруктураПараметров.ИмяДокумента + "." + СокрЛП(СтруктураПараметров.ИмяТабличнойЧасти);
	// Определение необязательных параметров
	ЕстьКачество        = Ложь;
	ТолькоОтрицательные = Ложь; // Из документа выбирать только строки с отрицательным количеством,
								// соответственно контроль остатков выполняется только для них.
								// Имеет смысл, например, для документа КорректировкаВнутреннегоЗаказа.
	КолЗнак             = "";   // Означает что знак "+", т.е. знак количества не меняем
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Если Параметры.Свойство("КачествоТолькоНовый") Тогда
			ЕстьКачество = Параметры.Свойство("КачествоТолькоНовый") И МетаданныеТабЧастиДокумента.Реквизиты.Найти("Качество") <> Неопределено;
		КонецЕсли;
		Если Параметры.Свойство("ТолькоОтрицательноеКоличество") Тогда
			ТолькоОтрицательные = Параметры["ТолькоОтрицательноеКоличество"];
		КонецЕсли;
	КонецЕсли;

	Если ЕстьЕдИзм Тогда
		ТекстКоличество = "Док.Количество * Док.Коэффициент / Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент";
	Иначе
		ТекстКоличество = "Док.Количество";
	КонецЕсли;
	
	Если ТолькоОтрицательные Тогда
		КолЗнак = "-";
	КонецЕсли;

	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    Запрос.Текст = "ВЫБРАТЬ
	|Ссылка,Номенклатура, "+
	?(СтруктураПараметров.ЕстьХарактеристика, "
	|	ХарактеристикаНоменклатуры,","")+"
	|	%Заказ% КАК Заказ,
	|	%Заказ%.Заказчик КАК Заказчик,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдИзм,
	|	Сумма( %КолЗнак% Количество) КАК Количество,
	|	СУММА( %КолЗнак% " + ТекстКоличество + " )    КАК ДокументКоличество
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|	ИЗ
	|		Документ." + ИмяТаблицы + " КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ДокументСсылка 
	| 		И %Заказ% ССЫЛКА Документ.ВнутреннийЗаказ
	| 		И %Заказ% <> &ПустВнутрЗаказ "
			+ ?(ЕстьКачество,        " И Док.Качество = &КачествоНовый ", "")
			+ ?(ТолькоОтрицательные, " И Док.Количество < 0 ", "") + "
	|	СГРУППИРОВАТЬ ПО Ссылка, Номенклатура, %Заказ%"+?(СтруктураПараметров.ЕстьХарактеристика, ",ХарактеристикаНоменклатуры","")+"
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%КолЗнак%", КолЗнак);
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Заказ%", ПутьКЗаказу);

	Запрос.УстановитьПараметр( "ДокументСсылка",  СтруктураПараметров.Ссылка);
    Запрос.УстановитьПараметр( "ПустВнутрЗаказ",  Документы.ВнутреннийЗаказ.ПустаяСсылка());
	Запрос.УстановитьПараметр( "КачествоНовый",   Справочники.Качество.Новый);

	Запрос.Выполнить();

КонецПроцедуры
